
# specify a directory to install
cask_args appdir: "/Applications"

# Setup the 'taps'
tap "caskroom/cask"
tap "caskroom/fonts"
tap 'brewsci/science'

# Fuse is required to be installed 
# for 'encfs' to work
cask 'osxfuse'

brew 'ack'
brew 'bash-completion'
brew 'ccache'
brew 'cmake'
brew 'cppcheck'
brew 'encfs'
brew 'exa'
brew 'fish'
brew 'gcc'
brew 'git'
brew 'grace'
brew 'feh'
brew 'hdf5'
brew 'hub'
brew 'json-fortran'
brew 'lftp'
brew 'nexusformat'
brew 'ninja'
brew 'source-highlight'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

## macOS specific stuff below

# Mac App Store
brew 'mas'

# Casks
cask 'atom'
cask 'blue-jeans'
cask 'caffeine'
cask 'dropbox'
cask 'etcher'
cask 'evernote'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'hyper'
cask 'iterm2'
cask 'java'
cask 'kaleidoscope'
cask 'lastpass'
cask 'omnigraffle'
cask 'omniplan'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'tower'
cask 'vivaldi'
cask 'vlc'
cask 'xquartz'

# Fonts
cask 'font-fira-code'
cask 'font-firacode-nerd-font'
cask 'font-fira-mono-for-powerline'
#cask 'font-sourcecodepro-nerd-font'
#cask 'font-hack-nerd-font'

#brew 'watchman' # https://facebook.github.io/watchman/docs/install.html
