
tap 'homebrew/science'

brew 'bash-completion'
brew 'exa'
brew 'gcc'
brew 'git'
brew 'grace'
brew 'hdf5'
brew 'hub'
brew 'lftp'
brew 'source-highlight'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'zsh'
brew 'zsh-syntax-highlighting'

## macOS specific stuff below

# Mac App Store
brew 'mas'

# specify a directory to install
cask_args appdir: "/Applications"
tap "caskroom/cask"
tap "caskroom/fonts"

# Casks
cask 'atom'
cask 'blue-jeans-launcher'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'github-desktop'
cask 'google-chrome'
cask 'hyper'  
cask 'iterm2'
cask 'kaleidoscope'
cask 'lastpass'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'tower'
cask 'vivaldi'
cask 'vlc'
cask 'xquartz'

# Fonts
cask 'font-fira-code'
cask 'font-fira-mono-for-powerline'

#brew 'watchman' # https://facebook.github.io/watchman/docs/install.html
