
tap 'homebrew/science'

brew 'bash-completion'
brew 'exa'
brew 'git'
brew 'vim'
brew 'wget'
brew 'zsh'

## macOS specific stuff below

# Mac App Store
brew 'mas'

# specify a directory to install
cask_args appdir: "/Applications"
tap "caskroom/cask"

# Casks
cask 'blue-jeans-launcher'
cask 'google-chrome'
cask 'vlc'
cask 'dropbox'
cask 'evernote'
cask 'slack'
cask 'skype'
cask 'sublime'
cask 'atom'
cask 'github-desktop'
cask 'lastpass'
cask 'xquartz'
cask 'lastpass'
cask 'vivaldi'


#brew 'watchman' # https://facebook.github.io/watchman/docs/install.html
